src/oy40/conf/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗанятостьКлассов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy40/conf/AccumulationRegisters/ЗанятостьКлассов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ЗанятостьКлассов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанятоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/oy40/conf/InformationRegisters/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Расписание</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курсы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy40/conf/Documents/Заявка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ЗанятостьКлассов.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Расписание");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Дата", Новый Диапазон(ДатаНачала, ДатаОкончания));
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗанятостьКлассов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Дата", Новый Диапазон(ДатаНачала, ДатаОкончания));
	
	Блокировка.Заблокировать();
	
	Движения.ЗанятостьКлассов.Очистить();
	Движения.ЗанятостьКлассов.Записать();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Расписание.Класс КАК Класс,
		|	Расписание.Дата КАК Дата,
		|	Расписание.Класс.КоличествоМест КАК МестВсего
		|ПОМЕСТИТЬ втРасписание
		|ИЗ
		|	РегистрСведений.Расписание КАК Расписание
		|ГДЕ
		|	Расписание.Курс = &Курс
		|	И Расписание.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Класс,
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРасписание.Класс КАК Класс,
		|	втРасписание.Дата КАК Дата,
		|	втРасписание.МестВсего - ЕСТЬNULL(ЗанятостьКлассовОбороты.ЗанятоМестОборот, 0) КАК СвободноМест
		|ИЗ
		|	втРасписание КАК втРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятостьКлассов.Обороты(
		|				,
		|				,
		|				,
		|				Класс В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							втРасписание.Класс
		|						ИЗ
		|							втРасписание)
		|					И (Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)) КАК ЗанятостьКлассовОбороты
		|		ПО втРасписание.Класс = ЗанятостьКлассовОбороты.Класс
		|			И втРасписание.Дата = ЗанятостьКлассовОбороты.Дата
		|ГДЕ
		|	втРасписание.МестВсего - ЕСТЬNULL(ЗанятостьКлассовОбороты.ЗанятоМестОборот, 0) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	втРасписание.Класс.КоличествоМест УБЫВ
		|ИТОГИ
		|	СУММА(СвободноМест)
		|ПО
		|	Дата");
	
	Запрос.УстановитьПараметр("Курс", Курс);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДата.Следующий() Цикл
		Если ВыборкаДата.СвободноМест = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаДата.Выбрать();
		Если Выборка.Следующий() Тогда
			Движение = Движения.ЗанятостьКлассов.Добавить();
			Движение.Период		 = Дата;
			Движение.Класс		 = Выборка.Класс;
			Движение.Дата		 = Выборка.Дата;
			Движение.ЗанятоМест	 = 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
